results/1/server1/Spock-0.7.7.0/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.49ms   38.43ms   1.90s    99.90%
    Req/Sec    14.40k     2.42k   30.20k    71.28%
  838781 requests in 30.00s, 117.59MB read
  Socket errors: connect 0, read 0, write 0, timeout 229
Requests/sec:  27957.99
Transfer/sec:      3.92MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.86ms   18.19ms   1.78s    99.61%
    Req/Sec    14.00k     2.17k   26.00k    70.77%
  820024 requests in 30.00s, 114.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 532
Requests/sec:  27333.00
Transfer/sec:      3.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.40ms  349.98ms   2.72s    98.25%
    Req/Sec    14.45k     4.49k   40.00k    69.12%
  821681 requests in 30.00s, 115.19MB read
  Socket errors: connect 0, read 17, write 0, timeout 545
Requests/sec:  27387.35
Transfer/sec:      3.84MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.11ms   21.41ms   1.84s    99.66%
    Req/Sec    14.14k     2.06k   22.93k    70.42%
  830353 requests in 30.00s, 116.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 324
Requests/sec:  27678.15
Transfer/sec:      3.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.27ms  358.86ms   2.71s    96.94%
    Req/Sec    14.80k     4.91k   43.89k    67.65%
  838463 requests in 30.00s, 117.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 364
Requests/sec:  27946.72
Transfer/sec:      3.92MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.55ms   20.99ms   1.71s    99.60%
    Req/Sec    14.14k     1.98k   21.18k    70.77%
  830519 requests in 30.00s, 116.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 156
Requests/sec:  27683.77
Transfer/sec:      3.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.68ms  248.55ms   2.68s    97.99%
    Req/Sec    14.68k     4.64k   36.80k    68.10%
  829789 requests in 30.00s, 116.33MB read
  Socket errors: connect 0, read 55, write 0, timeout 522
Requests/sec:  27659.30
Transfer/sec:      3.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.07ms   19.55ms   1.86s    99.63%
    Req/Sec    14.32k     2.18k   25.48k    72.86%
  838392 requests in 30.00s, 117.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 152
Requests/sec:  27946.18
Transfer/sec:      3.92MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.11ms  225.72ms   2.51s    98.68%
    Req/Sec    14.53k     4.24k   43.33k    68.96%
  820236 requests in 30.00s, 114.99MB read
  Socket errors: connect 0, read 30, write 0, timeout 156
Requests/sec:  27341.01
Transfer/sec:      3.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.62ms   34.98ms   2.55s    99.90%
    Req/Sec    14.21k     2.22k   27.91k    69.82%
  830380 requests in 30.00s, 116.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 116
Requests/sec:  27679.42
Transfer/sec:      3.88MB
=================== summary ===================
machine:      server1
ghc version:  7.8.4
bench target: Spock-0.7.7.0
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      27661.29
stdev:        244.31
=================== oneline ===================
server1,7.8.4,Spock-0.7.7.0,AFTER_DEEP,30s,10,27661.29,244.31